Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: A Certificate Revocation List (CRL) is a list of certificates that the issuing Certificate Authority (CA) revoked before their scheduled expiration date. When a certificate is compromised, no longer needed, or deemed invalid, the CA adds it to the CRL to inform relying parties not to trust it anymore.
ja_jp: 証明書失効リスト (CRL) は、予定の有効期限より前に発行元の認証局 (CA) によって失効させられたデジタル証明書のリストです。 証明書が侵害されたり、不要になったり、無効と判断されたりした場合、CA は証明書を CRL に追加して、その証明書を信頼しないよう証明書利用者に通知します。

source: A Chicory extension for Quarkus applications
ja_jp: Quarkus アプリケーション用 Chicory エクステンション

source: A ClassLoader is said to be 'transformer safe' if it is safe to load classes in the class loader before the transformers are ready. Once a class has been loaded it cannot be changed, so if a class is loaded before the transformers have been prepared this will prevent the transformation from working. Loading classes in a transformer safe ClassLoader will not prevent the transformation, as the loaded class is not used at runtime.
ja_jp: ClassLoader は、Transformer が準備される前にクラスをロードしても安全であれば、「Transformerセーフ」と言われます。一度ロードされたクラスは変更することができないので、もし Transformer の準備が整う前にロードされた場合、変換が機能しなくなります。Transformer セーフな ClassLoader でクラスをロードした場合は、ロードされたクラスは実行時には使用されないので、変換を妨げることはありません。

source: A Codestart is a template for scaffolding new project.
ja_jp: Codestart は、新しいプロジェクトの足場を作るためのテンプレートです。

source: A Codestart is a template for scaffolding new project. The easiest way to prepare a Codestart is to generate a Quarkus project, add the content you want in your template and then create your Codestart from there.
ja_jp: コードスタートは、新しいプロジェクトの足場となるテンプレートです。 コードスタートを準備する最も簡単な方法は、Quarkusプロジェクトを生成し、テンプレートに必要なコンテンツを追加し、そこからコードスタートを作成することです。

source: A Config Mapping requires an interface with minimal metadata configuration annotated with `@io.smallrye.config.ConfigMapping`:
ja_jp: 設定マッピングには、 `@io.smallrye.config.ConfigMapping` アノテーションが付与された最小限のメタデータ設定を持つインターフェースが必要です。

source: A Credentials Provider may provide time limited credentials. For instance, the `vault` extension. When using time limited credentials, it is important to understand that consuming extensions will not have their credentials refreshed automatically by the Credentials Provider. Each extension must be configured to recycle its connections before the credentials expire.
ja_jp: クレデンシャルプロバイダは、期間限定クレデンシャルを提供することができます。 たとえば、 `vault` エクステンション。期限付きクレデンシャルを使用する場合、消費するエクステンションはクレデンシャルプロバイダによって自動的にクレデンシャルをリフレッシュされないことを理解することが重要です。 各エクステンションは、クレデンシャルの有効期限が切れる前に接続をリサイクルするように設定する必要があります。

source: A DLX to assign to the queue. Relevant only if auto-bind-dlq is true Type: _string_
ja_jp: キューに割り当てる DLX。auto-bind-dlq が true の場合にのみ関連します。 Type: _string_

source: A DMN model is an open standard for visual and semantic execution of declarative logic; DMN allows you to externalise decision logic into reusable pieces that can be easily used in declarative way. There are multiple ways of writing rules other than DMN, like: decision tables, decision trees, rules, etc.
ja_jp: DMNモデルは、宣言型ロジックを視覚的かつ意味的に実行するためのオープンスタンダードです。DMNを使用すると、意思決定ロジックを再利用可能なパーツに外部化することができ、宣言的な方法で簡単に使用することができます。DMN以外にも、デシジョンテーブル、デシジョンツリー、ルールなど、様々なルールの書き方があります。

source: A Dev Service for Oracle has been added: start your Oracle database automatically in dev and test mode.
ja_jp: OracleのDev Serviceが追加され、Oracleデータベースを自動的に開発/テストモードで起動するようになりました。

source: A Go CEL Policy Engine in Java, with Quarkus Chicory
ja_jp: Quarkus Chicory を活用した Java による Go CEL ポリシーエンジンの構築

source: A HTTP server can redirect a response to another location by sending a response with a status code that starts with "3" and a HTTP header "Location" holding the URL to be redirected to. When the REST Client receives a redirection response from a HTTP server, it won't automatically perform another request to the new location. However, you can enable the automatic redirection by enabling the "follow-redirects" property:
ja_jp: HTTPサーバーは、ステータスコードが "3 "で始まるレスポンスと、リダイレクト先のURLを保持するHTTPヘッダー "Location "を送信することで、レスポンスを別の場所にリダイレクトできます。RESTクライアントがHTTPサーバーからリダイレクトレスポンスを受信しても、新しい場所への再リクエストは自動的に実行されません。ただし、"follow-redirects "プロパティを有効にすることで、自動リダイレクトを有効にすることができます:

source: A HTTP server can redirect a response to another location by sending a response with a status code that starts with "3" and a HTTP header "Location" holding the URL to be redirected to. When the REST Client receives a redirection response from a HTTP server, it won't automatically perform another request to the new location. We can enable the automatic redirection in REST Client by adding the "follow-redirects" property:
ja_jp: HTTPサーバーは、ステータスコードが "3 "で始まるレスポンスと、リダイレクト先のURLを保持するHTTPヘッダー "Location" を送信することで、レスポンスを別の場所にリダイレクトできます。RESTクライアントがHTTPサーバーからリダイレクトレスポンスを受信しても、新しい場所への再リクエストを自動的に実行することはありません。"follow-redirects"プロパティを追加することで、REST Clientで自動リダイレクトを有効にすることができます:

source: A Hibernate with Panache repository is:
ja_jp: Panache を使用した Hibernate リポジトリは次のとおりです。

source: A JDBC driver extension (`quarkus-jdbc-postgresql`, `quarkus-jdbc-h2`, `quarkus-jdbc-mariadb`, ...)
ja_jp: JDBC ドライバーエクステンション ( `quarkus-jdbc-postgresql` , `quarkus-jdbc-h2` , `quarkus-jdbc-mariadb` , ...)

source: A Java record that implements `io.quarkus.qute.TemplateInstance` and its name contains a dollar sign `$`.
ja_jp: `io.quarkus.qute.TemplateInstance` を実装し、その名前にドル記号 `$` が含まれる Java レコード。

source: A Java record that implements `io.quarkus.qute.TemplateInstance` denotes a type-safe template. The record components represent the template parameters and `@io.quarkus.qute.CheckedTemplate` can be optionally used to configure the template.
ja_jp: `io.quarkus.qute.TemplateInstance` を実装する Java レコードは、タイプセーフなテンプレートを表します。 レコードコンポーネントはテンプレートパラメーターを表し、オプションで `@io.quarkus.qute.CheckedTemplate` を使用してテンプレートを設定できます。

source: A Java type should be always identified with a _fully qualified name_ unless it's a JDK type from the `java.lang` package - in this case, the package name is optional. Parameterized types are supported, however wildcards are always ignored - only the upper/lower bound is taken into account. For example, the parameter declaration `{@java.util.List<? extends org.acme.Foo> list}` is recognized as `{@java.util.List<org.acme.Foo> list}`. Type variables are not handled in a special way and should never be used.
ja_jp: Java タイプは、`java.lang` パッケージの JDK タイプでない限り、常に _fully qualified name_ で識別される必要があります。この場合、パッケージ名はオプションです。 パラメーター化されたタイプもサポートされていますが、ワイルドカードは常に無視され、上限と下限のみが考慮されます。 たとえば、パラメーター宣言 `{@java.util.List<? extends org.acme.Foo> list}` は `{@java.util.List<org.acme.Foo> list}` として認識されます。 タイプ変数は特別な方法で扱われることはないため、決して使用しないでください。

source: A Job can also be scheduled programmatically, using the JobScheduler API and the Quarkus startup event:
ja_jp: JobScheduler API と Quarkus の起動イベントを使用して、ジョブはプログラムによってスケジュールすることもできます。

source: A Keycloak server issues the bearer token and represents the subject for which the token was issued. Because it is an OAuth 2.0 authorization server, the token also references the client acting on the user's behalf.
ja_jp: Keycloak サーバーはベアラートークンを発行し、トークンが発行されたサブジェクトを表します。 これは OAuth 2.0 認可サーバーであるため、トークンはユーザーに代わって動作するクライアントも参照します。

source: A Kubernetes API server is automatically started in dev or test modes whenever the `quarkus-kubernetes-client` extension is configured for a project. However, the dev service is disabled in some cases to prevent potential confusing situations:
ja_jp: プロジェクトに `quarkus-kubernetes-client` エクステンションが設定されている場合、開発モードまたはテストモードで Kubernetes API サーバーが自動的に起動されます。しかし、潜在的な混乱を避けるため、dev service がいくつかのケースで無効になることがあります。

source: A Kubernetes Ingress resource making the `color-service` accessible from the outside of the cluster at the `color-service.127.0.0.1.nip.io` url. Not that the Ingress is not needed for Stork however, it helps to check that the architecture is in place.
ja_jp: `color-service.127.0.0.1.nip.ioURL` でクラスターの外部から `color-service` にアクセスできるようにする Kubernetes Ingress リソース。Ingress が Stork に必要ないわけではありませんが、アーキテクチャーが整っていることを確認するのに役立ちます。

source: A Kubernetes Ingress resource making the `color-service` accessible from the outside of the cluster at the `color-service.127.0.0.1.nip.io` url. Note that the Ingress is not needed for Stork however, it helps to check that the architecture is in place.
ja_jp: Kubernetes Ingressリソースで、クラスタの外部から `color-service.127.0.0.1.nip.io` urlで `color-service` をアクセス可能にします。IngressはStorkには必要ありませんが、アーキテクチャが整っているか確認するのに役立ちます。

source: A Kubernetes Native Java stack tailored for OpenJDK HotSpot and GraalVM, crafted from the best of breed Java libraries and standards.
ja_jp: 各分野最高のライブラリと標準で構成された、GraalVMとHotSpot向けに最適化されたKubernetesネイティブJavaスタック

source: A Kubernetes-style CEL Policy Engine
ja_jp: Kubernetes スタイルの CEL ポリシーエンジン

source: A Mongo Client (either default or named) must always be discoverable at build-time to be considered for runtime injection. This can be done by injecting the Mongo Client name with `@MongoClientName`. If the Mongo Client name may be active or inactive, it needs to use the wrapper `InjectableInstance<>`, or else Quarkus will throw an exception at startup time if the Mongo Client is inactive. Alternatively, Mongo Clients may also be discovered via configuration.
ja_jp: Mongo クライアント (デフォルトまたは名前付き) は、実行時インジェクションの対象となるために、常にビルド時に検出可能である必要があります。これは、`@MongoClientName` を使用して Mongo クライアント名を注入することで実現できます。Mongo クライアント名がアクティブまたは非アクティブになる可能性がある場合、ラッパー `InjectableInstance<>` を使用する必要があります。そうしないと、Mongo クライアントが非アクティブな場合に Quarkus は起動時に例外をスローします。あるいは、Mongo クライアントは設定を介して検出することもできます。

source: A New JDBC Persistence Layer: Enhancing the reliability and flexibility of catalog metadata storage and configuration management.
ja_jp: 新しい JDBC 永続化層：カタログメタデータストレージと設定管理の信頼性と柔軟性を向上させます。

source: A Parent Profile adds one level of hierarchy to the current profile. The configuration `quarkus.config.profile.parent` accepts a single profile name.
ja_jp: 親プロファイルは、現在のプロファイルに 1 レベルの階層を追加します。設定 `quarkus.config.profile.parent` は、単一のプロファイル名を受け入れます。

source: A Picocli command line application can be packaged in multiple formats (e.g. a JAR, a native executable) and can be published to various repositories (e.g. Homebrew, Chocolatey, SDKMAN!).
ja_jp: Picocli コマンドラインアプリケーションは、複数のフォーマット (JAR、ネイティブ実行可能ファイルなど) でパッケージ化でき、さまざまなリポジトリー (Homebrew、Chocolatey、SDKMAN など) に公開できます。

source: A Picocli command line application is a standard Quarkus application and as such can be published as a JAR in various packaging formats (e.g. fast-jar, uber-jar).
ja_jp: Picocli コマンドラインアプリケーションは標準の Quarkus アプリケーションであるため、さまざまなパッケージフォーマット (fast-jar、uber-jar など) で JAR として公開できます。

source: A Pulsar cluster consists of
ja_jp: Pulsar クラスターは、以下の要素で構成されます。

source: A Quarkiverse extension MUST belong to the `io.quarkiverse.<project>` groupId
ja_jp: Quarkiverseのエクステンションは、 `io.quarkiverse.<project>` groupIdに属していなければなりません。

source: A Quarkiverse extension has the following structure:
ja_jp: Quarkiverseのエクステンションは、次のような構造です:

source: A Quarkus application uses the https://github.com/smallrye/smallrye-config[SmallRye Config] API to provide all mechanisms related with configuration.
ja_jp: Quarkusアプリケーションは link:https://github.com/smallrye/smallrye-config[SmallRye Config] APIを使用して、設定に関連するすべてのメカニズムを提供します。

source: A Quarkus extension consists of two parts:
ja_jp: Quarkus のエクステンションは、2 つの部分から構成されています。

source: A Quarkus extension may declare one or more conditional dependencies on other Quarkus extensions or regular Maven artifacts.
ja_jp: Quarkus エクステンションは、他の Quarkus エクステンションまたは通常の Maven アーティファクトに対する 1 つ以上の条件付き依存関係を宣言できます。

source: A Quarkus extension may define a list of `cli-plugins` as part of its metadata. The list may contain GACTV string pointing to executable jars.
ja_jp: Quarkus エクステンションは、メタデータの一部として `cli-plugins` のリストを定義する場合があります。 リストには、実行可能な jar を指す GACTV 文字列が含まれる場合があります。

source: A Quarkus extension registry client may be configured to limit the extension catalog provided by the registry to a specific offering. For example, with the following configuration, assuming `registry.acme.org` provides extensions associated with multiple offerings, only those extensions associated with `acme-cloud` offering will be returned by the registry client:
ja_jp: Quarkus エクステンションレジストリークライアントは、レジストリーが提供するエクステンションカタログを特定のオファリングに制限するように設定できます。例えば、`registry.acme.org` が複数のオファリングに関連付けられたエクステンションを提供していると仮定した場合、以下の設定では、`acme-cloud` オファリングに関連付けられたエクステンションのみがレジストリークライアントによって返されます。

source: A Quarkus extension registry is a database providing information about:
ja_jp: Quarkusのエクステンションレジストリは、以下の情報を提供するデータベースです:

source: A Quarkus extension? That sounds like a lot of work?
ja_jp: Quarkusのエクステンション？それは大変そうですね？

source: A Quarkus platform may provide its own default values for some configuration options.
ja_jp: Quarkusプラットフォームでは、幾つかの設定オプションに対して独自のデフォルト値を提供している場合があります。

source: A Quarkus platform may provide its own default values for some of the configuration options.
ja_jp: Quarkusプラットフォームでは、一部の設定オプションに対して独自のデフォルト値を提供している場合があります。

source: A REST Client calling the blue or red service (the selection is delegated to Stork)
ja_jp: ブルーまたはレッドのサービスを呼び出すRESTクライアント（選択はStorkに委ねられている）

source: A REST endpoint using the REST client and calling the services
ja_jp: RESTクライアントを使用し、サービスを呼び出すRESTエンドポイント

source: A Redis Client (either default or named) must always be discoverable at build-time to be considered for runtime injection. This can be done by injecting the Redis Client name with `@RedisClientName`. If the Redis Client name may be active or inactive, it needs to use the wrapper `InjectableInstance<>`, or else Quarkus will throw an exception at startup time if the Redis Client is inactive. Alternatively, Redis Clients may also be discovered via configuration.
ja_jp: Redis クライアント (デフォルトまたは名前付き) は、実行時のインジェクション対象となるために、常にビルド時に検出可能である必要があります。 これは、 `@RedisClientName` を使用して Redis クライアント名をインジェクトすることで実行できます。 Redis クライアント名がアクティブまたは非アクティブになる可能性がある場合は、ラッパーの `InjectableInstance<>` を使用する必要があります。そうしないと、 Redis クライアントが非アクティブな場合に Quarkus が起動時に例外をスローします。 あるいは、 Redis クライアントは設定を介して検出される場合もあります。

source: A Redis transaction can _watch_ a set of keys, which would _discard_ the transaction is one of these keys are updated during the transaction execution.
ja_jp: Redis トランザクションはキーのセットを _監視_ することができ、トランザクションの実行中にこれらのキーのいずれかが更新された場合、トランザクションを _破棄_ します。

source: A Template Accessing Global Variables
ja_jp: グローバル変数にアクセスするテンプレート

source: A URL Macro link with attributes
ja_jp: 属性を持つ URL マクロリンク

source: A Vert.x reactive database driver extension (`quarkus-reactive-pg-client`, `quarkus-reactive-mysql-client`, ...)
ja_jp: Vert.x リアクティブデータベースドライバエクステンション ( `quarkus-reactive-pg-client`, `quarkus-reactive-mysql-client`, ...)

source: A Web component page is just a JavaScript Class that creates a new HTML Element:
ja_jp: Web コンポーネントページは、新しい HTML 要素を作成する JavaScript クラスです。

source: A WebAuthn or PassKeys-capable device, or https://developer.chrome.com/docs/devtools/webauthn/[an emulator of those].
ja_jp: WebAuthn または PassKeys 対応デバイス、または https://developer.chrome.com/docs/devtools/webauthn/[それらのエミュレーター]。

source: A WebSocket endpoint may declare:
ja_jp: WebSocket エンドポイントは以下を宣言できます。

source: A _build step_ is a non-static method which is annotated with the `@io.quarkus.deployment.annotations.BuildStep` annotation. Each build step may <<consuming-values,consume>> items that are produced by earlier stages, and <<producing-values,produce>> items that can be consumed by later stages. Build steps are normally only run when they produce a build item that is ultimately consumed by another step.
ja_jp: _ビルドステップ_ は、 `@io.quarkus.deployment.annotations.BuildStep`アノテーションを持つ非静的なメソッドです。 各ビルドステップは、前のステージで生成された項目を <<consuming-values,消費>> し、後のステージで消費可能な項目を <<producing-values,生成>> することができます。ビルドステップは通常、最終的に他のステップで消費されるビルド項目を生成する場合にのみ実行されます。

source: A _capability_ represents a technical capability that can be queried by other extensions. An extension may provide multiple capabilities and multiple extensions can provide the same capability. By default, capabilities are not displayed to users. Capabilities should be used when checking for the presence of an extension rather than class path based checks.
ja_jp: _ケイパビリティ_ は、他のエクステンションから問い合わせ可能な技術的能力を表します。1つのエクステンションが複数のケイパビリティを提供することも、複数のエクステンションが同じケイパビリティを提供することもできます。デフォルトでは、ケイパビリティはユーザーに表示されません。エクステンションの存在を確認する際には、クラスパスベースのチェックではなく、ケイパビリティを使用する必要があります。

source: A _feature_ represents a functionality provided by an extension. The name of the feature gets displayed in the log during application bootstrap.
ja_jp: _フィーチャー_ とは、エクステンションが提供する機能のことです。フィーチャーの名前は、アプリケーションの起動時にログに表示されます。

source: A _generated wrapper bean_ is injected instead of the original bean that implements the `PingService`.
ja_jp: `PingService` を実装する元の Bean の代わりに、_生成されたラッパー Bean_ が注入されます。

source: A _metadata store_ for maintaining topic metadata, schema, coordination and cluster configuration.
ja_jp: トピックのメタデータ、スキーマ、調整、クラスター設定を維持するための _メタデータストア_。

source: A _native static_ method annotated with `@CheckedTemplate`, with a name that contains a dollar sign `$`.
ja_jp: ドル記号 `$` を含む名前を持つ、`@CheckedTemplate` でアノテーションされた _native static_ メソッド。

source: A _score_ represents the quality of a specific solution. The higher the better. OptaPlanner looks for the best solution, which is the solution with the highest score found in the available time. It might be the _optimal_ solution.
ja_jp: _スコア_ は特定のソリューションの品質を表します。 高いほど優れています。 OptaPlannerは、利用可能な時間内に見つかった最も高いスコアを持つ解である、最良の解を探します。 それは _最適_ 解かもしれません。

source: A _score_ represents the quality of a specific solution. The higher, the better. OptaPlanner looks for the best solution, which is the solution with the highest score found in the available time. It might be the _optimal_ solution.
ja_jp: _スコア_ は、特定のソリューションの品質を表します。スコアが高ければ品質が高いことを表しています。OptaPlanner は使用できる時間内に見つかった最高スコアのソリューションを最良のソリューションとして探します。それは _最適な_ ソリューションかもしれません。

source: A _service interface_ using the Mutiny API
ja_jp: Mutiny APIを使用した _サービスインターフェース_

source: A _session scoped bean_ that represents the connection to the client. It allows sending messages programmatically and retrieve the path parameters.
ja_jp: クライアントへの接続を表す _セッションスコープ Bean_。これにより、プログラムでメッセージを送信し、パスパラメーターを取得できます。

source: A _type_, for example, `acme`, identifies each provider. This _type_ is used in the configuration to reference the provider:
ja_jp: _type_ は、例えば `acme` のように、各プロバイダーを識別します。この _type_ は、設定でプロバイダーを参照するために使用されます。

source: A `.env` file is also generated when generating the certificate, making the Quarkus dev mode aware of these certificates.
ja_jp: 証明書を生成するときに `.env` ファイルも生成されます。これにより、Quarkus 開発モードがこれらの証明書を認識するようになります。

source: A `@ConfigMapping` can be injected into any CDI aware bean:
ja_jp: `@ConfigMapping` は、任意の CDI 対応 Bean にインジェクトできます。

source: A `@Singleton` bean has no <<client_proxies,client proxy>> and hence an instance is _created eagerly_ when the bean is injected. By contrast, an instance of an `@ApplicationScoped` bean is _created lazily_, i.e. when a method is invoked upon an injected instance for the first time.
ja_jp: `@Singleton` Bean には <<client_proxies,client proxy>> がないため、Bean が注入されるとインスタンスは _即座に作成_ されます。対照的に、 `@ApplicationScoped` Bean のインスタンスは _遅延作成_ (つまり、 注入されたインスタンスに対してメソッドが初めて呼び出されるとき) されます。

source: A `@Singleton` bean has no xref:client_proxies[client proxy] and hence an instance is _created eagerly_ when the bean is injected. By contrast, an instance of an `@ApplicationScoped` bean is _created lazily_, i.e. when a method is invoked upon an injected instance for the first time.
ja_jp: `@Singleton` Beanは， xref:client_proxies[クライアントプロキシ] がなく，したがって，Beanが注入されるときに，インスタンスが _即座に(eagerly)生成_ されます。対照的に， `@ApplicationScoped` Beanのインスタンスは，注入されたインスタンスに対してメソッドが初めて呼び出されるとき，すなわち， _遅延的に生成_ されます。

source: A `@WebSocket` endpoint can encapsulate static nested classes, which are also annotated with `@WebSocket` and represent _sub-websockets_. The resulting path of these sub-websockets concatenates the path from the enclosing class and the nested class. The resulting path is normalized, following the HTTP URL rules.
ja_jp: `@WebSocket` エンドポイントは、静的なネストされたクラスをカプセル化できます。これらのクラスも `@WebSocket` アノテーションが付与され、_sub-websocket_ を表します。 これらの sub-websocket のパスは、外側のクラスとネストされたクラスからのパスを連結したものになります。 この結果得られるパスは、HTTP URL の規則に従って正規化されます。

source: A `BytecodeTransformerBuildItem` can be used to manipulate bytecode. For example, see this link:https://quarkus.io/blog/solving-problems-with-extensions/[blog about removed problematic bridge methods from a dependency].
ja_jp: `BytecodeTransformerBuildItem` を使用してバイトコードを操作できます。 たとえば、link:https://quarkus.io/blog/solving-problems-with-extensions/[依存関係から問題のあるブリッジメソッドを削除したブログ] を参照してください。

source: A `ClientHeadersFactory` can look as follows:
ja_jp: `ClientHeadersFactory` は次のようになります。

source: A `ClientMultipartForm` is created.
ja_jp: `ClientMultipartForm` が作成されました。

source: A `CompletationStage` of any `@Dao`-annotated interface, e.g. `CompletionStage<FruitDao>`.
ja_jp: `@Dao` アノテーションの付与されたインタフェースの `CompletationStage` 。例： `CompletionStage<FruitDao>` 。

source: A `CompletionStage` of any `@Dao`-annotated interface, e.g. `CompletionStage<FruitDao>`.
ja_jp: `@Dao` -アノテーションの付与されたインターフェースの `CompletionStage` （例： `CompletionStage<FruitDao>` ）。

source: A `ContainerResponseFilter` will also be called for <<exception-mapping, handled>> exceptions.
ja_jp: `ContainerResponseFilter` は <<exception-mapping, handled>> 例外でも呼び出されます。

source: A `CoolService` is created during startup to service the observer method invocation.
ja_jp: `CoolService` は、起動時に作成され、オブザーバーメソッドの呼び出しを処理します。

source: A `CriteriaBuilderFactory` and an `EntityViewManager` will be created based on the configured `EntityManagerFactory` as provided by the xref:hibernate-orm.adoc[Hibernate-ORM extension].
ja_jp: `CriteriaBuilderFactory` と `EntityViewManager` は、 link:{quarkus-home-url}/guides/hibernate-orm[Hibernate-ORM エクステンション] で提供される設定済の `EntityManagerFactory` に基づいて作成されます。

source: A `List` or `Optional` of any of the above types
ja_jp: 上記のタイプのいずれかの `List` または `Optional`

source: A `LocaleResolver` may return null if it cannot resolve the locale, it will then be ignored.
ja_jp: `LocaleResolver` は、ロケールを解決できない場合は null を返すかもしれない。その場合は無視される。

source: A `LogHandlerBuildItem` is a convenient way to redirect application logs. See this link:https://quarkus.io/blog/quarkus-aws-cloudwatch_extension/[worked example of an extension which directs output to AWS CloudWatch].
ja_jp: `LogHandlerBuildItem` は、アプリケーションログをリダイレクトする便利な方法です。link:https://quarkus.io/blog/quarkus-aws-cloudwatch_extension[出力を AWS CloudWatch に転送するエクステンションの実例] を参照してください。

source: A `Map` can be used for configuration at any position where a configuration group would be allowed. The key type of such a map *must* be `String`, and its value may be either a configuration group class or a valid leaf type. The configuration key segment following the map's key segment will be used as the key for map values.
ja_jp: `Map` は、設定グループが許可される任意の位置での設定に使用できます。このようなマップのキータイプは *必ず* `String` でなければならず、その値は設定グループクラスまたは有効なリーフタイプのいずれかになります。マップのキーセグメントに続く設定キーセグメントは、マップ値のキーとして使用されます。

source: A `Message` is an envelope around a payload. In the examples above only payloads were used, but every payload is wrapped around a `Message` internally in Quarkus Messaging.
ja_jp: `Message` はペイロードを包むエンベロープです。 上記の例ではペイロードのみが使用されていましたが、Quarkus Messaging ではすべてのペイロードが内部的に `Message` でラップされています。

source: A `Multi<Buffer>` - the buffers are written one by one (one per _chunk_) without any processing.
ja_jp: `Multi<Buffer>` - バッファーは処理なしで 1 つずつ ( _チャンク_ ごとに 1 つ) 書き込まれます。

source: A `Multi<Object>` - the items are encoded to JSON written one by one in the response.
ja_jp: `Multi<Object>` - アイテムは、 JSON にエンコードされ、レスポンスに 1 つずつ書き込まれるます。

source: A `Multi<String>` - the items are written one by one (one per _chunk_) in the response.
ja_jp: `Multi<String>` - アイテムはレスポンスに 1 つずつ ( _チャンク_ ごとに 1 つ) 書き込まれます。

source: A `Multi<X>` with X as the message type.
ja_jp: メッセージタイプが X の `Multi<X>`。
